{"status":"ok","totalResults":10,"articles":[{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Mueller warns of losing integrity in 2013 speech - CNN Video","description":"CNN's Chris Cuomo shares a clip of Robert Mueller's 2013 commencement address at the College of William & Mary in which he warns graduates about a predicament similar to the one President Donald Trump faces today.","url":"http://us.cnn.com/videos/politics/2019/01/15/trump-integrity-mueller-commencement-cuomo-closing-argument-vpx.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190114223746-chris-cuomo-closing-argument-01142019-super-tease.jpg","publishedAt":"2019-01-15T09:38:46.1386056Z","content":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"AG pick Barr on presidential investigations (1992) - CNN Video","description":"Listen to what the newly nominated attorney general William Barr says about handling presidential wrongdoing in a 1992 interview with Larry King.","url":"http://us.cnn.com/videos/politics/2018/12/07/william-barr-attorney-general-presidential-investigation-larry-king-nws-orig.cnn","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/181207121844-william-barr-attorney-general-presidential-investigation-larry-king-nws-orig-00002428-super-tease.jpg","publishedAt":"2019-01-15T08:08:46.2095547Z","content":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."},{"source":{"id":"cnn","name":"CNN"},"author":"Walter Shaub","title":"Stop Trump's slow-motion Saturday Night Massacre","description":"Walter Shaub writes that the Senate should demand that attorney general nominee William Barr promise to recuse himself from overseeing the Mueller investigation to preserve the principle that a president cannot select his own investigators.","url":"http://us.cnn.com/2019/01/14/opinions/senate-must-stop-trump-slow-motion-saturday-night-massacre-shaub/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190114105153-donald-trump-william-barr-split-super-tease.jpg","publishedAt":"2019-01-15T06:06:23Z","content":"Walter M. Shaub Jr., former director of the US Office of Government Ethics, is a CNN contributor and senior adviser for Citizens for Ethics and Responsibility in Washington, a nonpartisan organization that advocates for strong ethics oversight and accountabil… [+6283 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Stephen Collinson, CNN","title":"How powerful is the president? Barr hearing to test fundamental question","description":"Attorney general nominee William Barr's Senate confirmation hearing Tuesday is expected to be a highly charged affair that's sure to test his opinion of just how powerful a president -- in this case, Donald Trump -- is.","url":"http://us.cnn.com/2019/01/15/politics/donald-trump-william-barr-attorney-general/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190114105153-donald-trump-william-barr-split-super-tease.jpg","publishedAt":"2019-01-15T06:00:56Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"David Shortell, CNN","title":"William Barr's Senate confirmation hearing: What to watch","description":"Over 25 years ago, Joe Biden, then the chairman of the Senate Judiciary Committee, endorsed the confirmation of a \"refreshing\" and \"honest\" young William Barr for attorney general.","url":"http://us.cnn.com/2019/01/15/politics/what-to-watch-william-barr-hearing/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190109105232-01-william-barr-01092019-super-tease.jpg","publishedAt":"2019-01-15T06:00:29Z","content":"Washington (CNN) Over 25 years ago, Joe Biden, then the chairman of the Senate Judiciary Committee, endorsed the confirmation of a \"refreshing\" and \"honest\" young William Barr for attorney general. Tuesday, Barr, President Donald Trump's choice to take over t… [+8377 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Ariane de Vogue, CNN Supreme Court Reporter","title":"Barr sent or discussed controversial memo with Trump lawyers","description":"Attorney General nominee William Barr shared a controversial memo last year with nearly all of President Donald Trump's lawyers concluding that an aspect of special counsel Robert Mueller's case could be \"fatally misconceived,\" Barr acknowledged Monday.","url":"http://us.cnn.com/2019/01/14/politics/barr-mueller-letter/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190109105232-01-william-barr-01092019-super-tease.jpg","publishedAt":"2019-01-15T05:11:11Z","content":null},{"source":{"id":"cnn","name":"CNN"},"author":"Alexandra Rojas and Sean Mcelwee","title":"A Democrat who votes with Trump 69% of the time should be primaried","description":"Incumbent Democrats, like Henry Cuellar, D-Texas, who have become complacent and out of touch with their constituents need to go, write Alexandra Rojas and Sean Mcelwee.","url":"http://us.cnn.com/2019/01/14/opinions/importance-of-challenging-democratic-incumbents-rojas-mcelwee/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190115033901-rep-henry-cuellar-010918-super-tease.jpg","publishedAt":"2019-01-15T03:33:04Z","content":"Alexandra Rojas is the executive director of Justice Democrats, the left-leaning grassroots organization that recruited Alexandria Ocasio-Cortez to run for Congress. Sean McElwee is a co-founder of Data for Progress, a progressive think tank. The opinions exp… [+8194 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Manu Raju, Ashley Killough and Clare Foran, CNN","title":"Steve King removed from committee assignments following racist comments","description":"Republican Rep. Steve King of Iowa has been removed from committee assignments following racist remarks, House Minority Leader Kevin McCarthy announced Monday, the latest development in bipartisan condemnation of King's recent interview that appeared to lamen…","url":"http://us.cnn.com/2019/01/14/politics/mitch-mcconnell-steve-king-condemnation/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/161011151637-steve-king-super-tease.jpg","publishedAt":"2019-01-15T02:59:43Z","content":"(CNN) Republican Rep. Steve King of Iowa has been removed from committee assignments following racist remarks, House Minority Leader Kevin McCarthy announced Monday, the latest development in bipartisan condemnation of King's recent interview that appeared to… [+5448 chars]"},{"source":{"id":"cnn","name":"CNN"},"author":"Analysis by Chris Cillizza, CNN Editor-at-large","title":"The 35 most astounding lines from Donald Trump's Jeanine Pirro interview","description":"President Donald Trump spent his Saturday night holed up in the White House, calling into Jeanine Pirro's show on Fox News.","url":"http://us.cnn.com/2019/01/14/politics/donald-trump-jeanine-pirro/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190114121129-02-trump-wh-01142019-super-tease.jpg","publishedAt":"2019-01-14T21:50:03Z","content":"THE POINT -- NOW ON YOUTUBE! In each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"READ: Attorney General nominee William Barr's prepared testimony","description":"Attorney General nominee William Barr said that, if confirmed, he would let special counsel Robert Mueller finish his investigation","url":"http://us.cnn.com/2019/01/14/politics/read-william-barr-senate-testimony/index.html","urlToImage":"https://cdn.cnn.com/cnnnext/dam/assets/190109105232-01-william-barr-01092019-super-tease.jpg","publishedAt":"2019-01-14T16:08:19Z","content":"Attorney General nominee William Barr said that, if confirmed, he would let special counsel Robert Mueller finish his investigation into Russian meddling in the 2016 presidential election and believes the results should be made public"}]}